[M_ThisTown MissionDefinition]
MissionName="We will not stop here"
MissionDescription="Father Hammer Thorosimin decided to destroy Thorberg. A few weeks ago, a thief killed everyone in the house, but Hammerlock hoped that the creature in his mouth would not destroy his old home.."
TurnInDescription="Mount Lier is a large autonomous region of Torosmia!"
MissionSummary="Defeat Thorosian at False Mountain."
MissionGiver="Mr. Hammerlock"
MissionTurnInLocation="Sir Hammerlock"
TeaserText="This mountain is home to the descendants of the monkeys, an endangered species. "

[M_ThisTown:ClearGraveyard MissionObjectiveDefinition]
ProgressMessage="Clean the grave"

[M_ThisTown:ClearGraveyardSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ThisTown:ClearPond MissionObjectiveDefinition]
ProgressMessage="It filters the water"

